УТ/src/DataProcessors/АУ_ЗаполнениеШтрихкодСУпаковки/АУ_ЗаполнениеШтрихкодСУпаковки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>АУ_ЗаполнениеШтрихкодСУпаковки</name>
</mdclass:DataProcessor>

УТ/src/InformationRegisters/ШтрихкодыНоменклатуры/ШтрихкодыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ШтрихкодыНоменклатуры</name>
  <resources>
    <name>УдалитьНоменклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьХарактеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьУпаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </resources>
  <dimensions>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ/src/DataProcessors/АУ_ЗаполнениеШтрихкодСУпаковки/Forms/Форма/Module.bsl
&НаСервере
Функция ПолучитьНоменклатуруПоШК(ШК)
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	             |	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура,
	             |	ШтрихкодыНоменклатуры.Характеристика КАК Характеристика,
	             |	ШтрихкодыНоменклатуры.Упаковка КАК Упаковка
	             |ИЗ
	             |	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	             |ГДЕ
	             |	ШтрихкодыНоменклатуры.Штрихкод = &Штрихкод";
	Запрос.УстановитьПараметр("Штрихкод",ШК);
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Номенклатура;
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура РаспознатьНаСервере(ЧастиКиза)
	
	//ИмяФайла=ПолучитьИмяВременногоФайла("txt");
	//ДвоичныеДанные.Записать(ИмяФайла);
	//
	//Текст=Новый ТекстовыйДокумент;
	//Текст.Прочитать(ИмяФайла);
	//УдалитьФайлы(ИмяФайла);
	
	
	//ТекШтрихкод=ПолучитьСтрокуИзДвоичныхДанных(Base64Значение(ДвоичныеДанные));
	//СчитанныйШтрихкод=ТекШтрихкод;
	
	//ЧастиКиза=СтрРазделить(СчитанныйШтрихкод,Символ(29),Ложь);
	
	Если ЧастиКиза.Количество()>0 Тогда
		Префикс=Лев(ЧастиКиза[0],2);
		ШтрихКод=Сред(ЧастиКиза[0],4,13);
		Постфикс=Сред(ЧастиКиза[0],17,2);
		Лот=Сред(ЧастиКиза[0],19);
		
		Номенклатура=ПолучитьНоменклатуруПоШК(Штрихкод);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Распознать(Команда)
	//РаспознатьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаписатьДанныеНаСервере()
	
	Если НЕ ЗначениеЗаполнено(Номенклатура) Тогда
		Сообщить("Не заполнена номенклатура, данные не записаны !");
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СчитанныйШтрихкод) Тогда
		Сообщить("Не заполнен штрихкод, данные не записаны !");
		Возврат;
	КонецЕсли;
	
	рег=РегистрыСведений.ШтрихкодыНоменклатуры.СоздатьМенеджерЗаписи();
	рег.Номенклатура=Номенклатура;
	рег.Штрихкод=Штрихкод;
	рег.Записать(Истина);
	
	рег=РегистрыСведений.ШтрихкодыНоменклатуры.СоздатьМенеджерЗаписи();
	рег.Номенклатура=Номенклатура;
	рег.Штрихкод=СчитанныйШтрихкод;
	рег.Записать(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьДанные(Команда)
	ЗаписатьДанныеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбщегоНазначенияУТ.НастроитьПодключаемоеОборудование(ЭтаФорма);
		
		ИспользоватьОбменСПодключаемымОборудованиемOffline = ПолучитьФункциональнуюОпцию(
			"ИспользоватьОбменСПодключаемымОборудованиемOffline");
	ОбщегоНазначенияУТ.НастроитьПодключаемоеОборудование(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(Неопределено, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтаФорма, "СканерШтрихкода");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// ПодключаемоеОборудование
	Если Источник = "ПодключаемоеОборудование"
	   И ВводДоступен() Тогда
		Если ИмяСобытия = "ScanData" И МенеджерОборудованияУТКлиент.ЕстьНеобработанноеСобытие() Тогда
			ОбработатьШтрихкоды(МенеджерОборудованияУТКлиент.ПреобразоватьДанныеСоСканераВМассив(Параметр));
		КонецЕсли;
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	
	// Неизвестные штрихкоды
	Если Источник = "ПодключаемоеОборудование"
		И ИмяСобытия = "НеизвестныеШтрихкоды"
		И Параметр.ФормаВладелец = УникальныйИдентификатор Тогда
		
		ДанныеШтрихкодов = Новый Массив;
		Для Каждого ПолученныйШтрихкод Из Параметр.ПолученыНовыеШтрихкоды Цикл
			ДанныеШтрихкодов.Добавить(ПолученныйШтрихкод);
		КонецЦикла;
		Для Каждого ПолученныйШтрихкод Из Параметр.ЗарегистрированныеШтрихкоды Цикл
			ДанныеШтрихкодов.Добавить(ПолученныйШтрихкод);
		КонецЦикла;
		
		ОбработатьШтрихкоды(ДанныеШтрихкодов);
		
	КонецЕсли;
	
КонецПроцедуры

// МеханизмВнешнегоОборудования
&НаКлиенте
Процедура ОбработатьШтрихкоды(ДанныеШтрихкодов)
	
	//Если Не ШтрихкодированиеНоменклатурыКлиент.ШтрихкодыВалидны(ДанныеШтрихкодов) Тогда
	//	Возврат;
	//КонецЕсли;
	
	//Текст=Новый ТекстовыйДокумент;
	
	Если ТипЗнч(ДанныеШтрихкодов) = Тип("Массив") И ДанныеШтрихкодов.Количество()>0 Тогда
		//МассивШтрихкодов = ДанныеШтрихкодов;
		ТекШтрихкод=ДанныеШтрихкодов[0].Штрихкод;
	Иначе
		ТекШтрихкод=ДанныеШтрихкодов.Штрихкод;
	КонецЕсли;
	
	//Текст.ДобавитьСтроку(ТекШтрихкод);
	//ИмяФайла=ПолучитьИмяВременногоФайла("txt");
	//Текст.Записать(ИмяФайла);
	
	//ДвоичныеДанные=ПолучитьДвоичныеДанныеИзСтроки(ТекШтрихкод);
	//ДвоичныеДанные=Новый ДвоичныеДанные(ИмяФайла);
	//УдалитьФайлы(ИмяФайла);
	
	//Сообщить(Base64Строка(ДвоичныеДанные));
	
	РаспознатьНаСервере(СтрРазделить(ТекШтрихкод,Символ(29),Ложь));
	
	//СтруктураПараметровДействия = Новый Структура;
	//СтруктураПараметровДействия.Вставить("НеизвестныеШтрихкоды", ДобавитьНоменклатуруПоШтрихкодам(МассивШтрихкодов));
	//СтруктураПараметровДействия.Вставить("ФормаВладелец",        УникальныйИдентификатор);
	//
	//Если ПравоРегистрацииШтрихкодовНоменклатурыДоступно
	//	И СтруктураПараметровДействия.НеизвестныеШтрихкоды.Количество() > 0 Тогда
	//	
	//	// ЭлектронноеВзаимодействие.РаботаСНоменклатурой
	//	ШтрихкодированиеНоменклатурыКлиент.ОбработатьНеизвестныеШтрихкоды(СтруктураПараметровДействия, КэшированныеЗначения, ЭтаФорма);
	//	// Конец ЭлектронноеВзаимодействие.РаботаСНоменклатурой			
	//	
	//КонецЕсли;
	
КонецПроцедуры // ПолученыШтрихкоды()
// Конец МеханизмВнешнегоОборудования
